{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: neo4j in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (5.13.0)\n",
      "Requirement already satisfied: pytz in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from neo4j) (2022.6)\n"
     ]
    }
   ],
   "source": [
    "!pip3 install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "URI = \"neo4j://localhost:7687\"\n",
    "AUTH = ('neo4j', 'neo4j1234')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Top Country has the highest airports\n",
    "#MATCH (p:Airport)\n",
    "#WITH p.country AS Country, COUNT(distinct p) AS airportCount\n",
    "#ORDER BY airportCount DESC\n",
    "#LIMIT 10\n",
    "#RETURN Country, airportCount\n",
    "\n",
    "def read_TopCountry_w_HighestAirports():\n",
    "    ll = {}\n",
    "    with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "        driver.verify_connectivity()\n",
    "        records, summary, keys = driver.execute_query(\n",
    "            \"\"\" \n",
    "            MATCH (p:Airport)\n",
    "            RETURN p.airport_id as Airport_ID, p.country AS Country\n",
    "            \"\"\",\n",
    "            database_=\"neo4j\", )\n",
    "        \n",
    "        for record in records: \n",
    "            #print(record.data())\n",
    "            airport_id = record.data()['Airport_ID']\n",
    "            country = record.data()['Country']\n",
    "\n",
    "            if country not in ll.keys():\n",
    "                ll[country] = [airport_id]\n",
    "            elif airport_id not in ll[country]:\n",
    "                ll[country].append(id)   \n",
    "    top_country = max(ll, key=lambda x: len(ll[x]))\n",
    "    highest_airports = len(ll[top_country])\n",
    "    print(f\"{top_country}: {highest_airports}\")\n",
    "         \n",
    "    driver.close() \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "United States: 1251\n"
     ]
    }
   ],
   "source": [
    "read_TopCountry_w_HighestAirports()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "#top k cities with most airlines\n",
    "#MATCH (p:Airport)-[r:Route]->(p2:Airport)\n",
    "#WITH p.city AS City, COLLECT(DISTINCT r.airline_name) AS Airlines\n",
    "#WITH City, Airlines, SIZE(Airlines) AS numofAirlines\n",
    "#ORDER BY numofAirlines DESC\n",
    "#LIMIT 10\n",
    "#RETURN City, Airlines, numofAirlines*/\n",
    "\n",
    "def read_TopKCities_w_MostAirlines():\n",
    "    with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "        driver.verify_connectivity()\n",
    "        records, summary, keys = driver.execute_query(\n",
    "            \"\"\" \n",
    "            MATCH (p:Airport)-[r:Route]->(p2:Airport)\n",
    "            WITH p.city AS City, COLLECT(DISTINCT r.airline_name) AS Airlines\n",
    "            WITH City, Airlines, SIZE(Airlines) AS numofAirlines\n",
    "            ORDER BY numofAirlines DESC\n",
    "            RETURN City, Airlines, numofAirlines\n",
    "            \"\"\",\n",
    "            database_=\"neo4j\", )\n",
    "        for record in records: \n",
    "            city = record.data()['City']\n",
    "            airline = record.data()['Airlines']\n",
    "            numofAirlines = record.data()[\"numofAirlines\"]\n",
    "            row = [city, numofAirlines]\n",
    "            print(row)\n",
    "    driver.close() "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Los Angeles', 17]\n",
      "['San Diego', 16]\n",
      "['Las Vegas', 16]\n",
      "['New York', 15]\n",
      "['Boston', 14]\n",
      "['Phoenix', 14]\n",
      "['Fort Lauderdale', 14]\n",
      "['Chicago', 14]\n",
      "['Orlando', 14]\n",
      "['San Francisco', 13]\n",
      "['Washington', 13]\n",
      "['Seattle', 13]\n",
      "['Dallas-Fort Worth', 13]\n",
      "['Portland', 13]\n",
      "['Minneapolis', 13]\n",
      "['Detroit', 12]\n",
      "['Fort Myers', 12]\n",
      "['New Orleans', 12]\n",
      "['Vancouver', 11]\n",
      "['Houston', 11]\n",
      "['Tampa', 11]\n",
      "['Atlanta', 11]\n",
      "['Denver', 11]\n",
      "['Edmonton', 10]\n",
      "['Ottawa', 10]\n",
      "['Newark', 10]\n",
      "['Austin', 10]\n",
      "['Philadelphia', 10]\n",
      "['Montreal', 9]\n",
      "['Oakland', 9]\n",
      "['Kansas City', 9]\n",
      "['Memphis', 9]\n",
      "['Cincinnati', 9]\n",
      "['Rochester', 9]\n",
      "['Raleigh-durham', 9]\n",
      "['St. Louis', 9]\n",
      "['Nashville', 9]\n",
      "['Honolulu', 9]\n",
      "['San Jose', 9]\n",
      "['Charleston', 9]\n",
      "['Baltimore', 9]\n",
      "['Charlotte', 9]\n",
      "['Halifax', 8]\n",
      "['Toronto', 8]\n",
      "['Calgary', 8]\n",
      "['Kahului', 8]\n",
      "['Cleveland', 8]\n",
      "['Myrtle Beach', 8]\n",
      "['Salt Lake City', 8]\n",
      "['Harrisburg', 8]\n",
      "['Pittsburgh', 8]\n",
      "['Indianapolis', 8]\n",
      "['Burbank', 8]\n",
      "['Little Rock', 8]\n",
      "['Columbus', 8]\n",
      "['Milwaukee', 8]\n",
      "['Des Moines', 8]\n",
      "['Syracuse', 8]\n",
      "['Sacramento', 8]\n",
      "['Windsor Locks', 8]\n",
      "['Palm Springs', 8]\n",
      "['Oklahoma City', 8]\n",
      "['Santa Ana', 8]\n",
      "['Albuquerque', 8]\n",
      "['Greenville', 8]\n",
      "['Quebec', 7]\n",
      "['Winnipeg', 7]\n",
      "['Omaha', 7]\n",
      "['Wichita', 7]\n",
      "['Spokane', 7]\n",
      "['Boise', 7]\n",
      "['Jackson', 7]\n",
      "['White Plains', 7]\n",
      "['Lihue', 7]\n",
      "['Richmond', 7]\n",
      "['Providence', 7]\n",
      "['Knoxville', 7]\n",
      "['Grand Rapids', 7]\n",
      "['Jacksonville', 7]\n",
      "['West Palm Beach', 7]\n",
      "['Anchorage', 7]\n",
      "['Reno', 7]\n",
      "['Buffalo', 7]\n",
      "['Tulsa', 7]\n",
      "['Albany', 7]\n",
      "['Greensboro', 7]\n",
      "['Kelowna', 6]\n",
      "['Victoria', 6]\n",
      "['Yellowknife', 6]\n",
      "['Kona', 6]\n",
      "['El Paso', 6]\n",
      "['Miami', 6]\n",
      "['Norfolk', 6]\n",
      "['San Antonio', 6]\n",
      "['Dayton', 6]\n",
      "['Tucson', 6]\n",
      "['Fresno', 6]\n",
      "['Burlington', 6]\n",
      "['Ontario', 6]\n",
      "['Birmingham', 6]\n",
      "['Islip', 6]\n",
      "['Key West', 6]\n",
      "['Sioux Falls', 6]\n",
      "['Manchester NH', 6]\n",
      "['Louisville', 6]\n",
      "['Roanoke VA', 6]\n",
      "['Lexington KY', 6]\n",
      "['Fort Wayne', 6]\n",
      "['Cedar Rapids', 6]\n",
      "['Flint', 6]\n",
      "['Eugene', 6]\n",
      "['Akron', 6]\n",
      "['Fargo', 6]\n",
      "['Bentonville', 6]\n",
      "['Moncton', 5]\n",
      "[\"St. John's\", 5]\n",
      "['Madison', 5]\n",
      "['Dallas', 5]\n",
      "['Lansing', 5]\n",
      "['Pensacola', 5]\n",
      "['Chattanooga', 5]\n",
      "['Shreveport', 5]\n",
      "['Savannah', 5]\n",
      "['Newport News', 5]\n",
      "['Midland', 5]\n",
      "['Newburgh', 5]\n",
      "['Corpus Christi', 5]\n",
      "['Colorado Springs', 5]\n",
      "['Lubbock', 5]\n",
      "['Amarillo', 5]\n",
      "['Elmira', 5]\n",
      "['Asheville', 5]\n",
      "['Bloomington', 5]\n",
      "['Peoria', 5]\n",
      "['Grand Junction', 5]\n",
      "['Sarasota', 5]\n",
      "['Moline', 5]\n",
      "['Rapid City', 5]\n",
      "['Scranton', 5]\n",
      "['Springfield', 5]\n",
      "['Allentown', 5]\n",
      "['Fort Mcmurray', 4]\n",
      "['Regina', 4]\n",
      "['Thunder Bay', 4]\n",
      "['Fort Smith', 4]\n",
      "['Saskatoon', 4]\n",
      "['Bangor', 4]\n",
      "['Gainesville', 4]\n",
      "['Lafayette', 4]\n",
      "['Minot', 4]\n",
      "['Columbia', 4]\n",
      "['Long Beach', 4]\n",
      "['Green Bay', 4]\n",
      "['Laredo', 4]\n",
      "['Tallahassee', 4]\n",
      "['Monroe', 4]\n",
      "['Killeen', 4]\n",
      "['Mobile', 4]\n",
      "['Mcallen', 4]\n",
      "['Watertown', 4]\n",
      "['Wilmington', 4]\n",
      "['Baton Rouge', 4]\n",
      "['Alexandria', 4]\n",
      "['Valparaiso', 4]\n",
      "['Ithaca', 4]\n",
      "['Monterey', 4]\n",
      "['Santa Barbara', 4]\n",
      "['Charlottesville VA', 4]\n",
      "['Evansville', 4]\n",
      "['Bozeman', 4]\n",
      "['Billings', 4]\n",
      "['Traverse City', 4]\n",
      "['Gulfport', 4]\n",
      "['Kalamazoo', 4]\n",
      "['Wassau', 4]\n",
      "['Bismarck', 4]\n",
      "['Medford', 4]\n",
      "['Redmond-Bend', 4]\n",
      "['Huntsville', 4]\n",
      "['BRISTOL', 4]\n",
      "['Binghamton', 4]\n",
      "['Erie', 4]\n",
      "['State College Pennsylvania', 4]\n",
      "['Fayetteville', 4]\n",
      "['Sault Sainte Marie', 3]\n",
      "['Waterloo', 3]\n",
      "['Windsor', 3]\n",
      "['Comox', 3]\n",
      "['Sudbury', 3]\n",
      "['Timmins', 3]\n",
      "['Terrace', 3]\n",
      "['London', 3]\n",
      "['Hilo', 3]\n",
      "['Grand Forks', 3]\n",
      "['Huron', 3]\n",
      "['Lake Charles', 3]\n",
      "['Bakersfield', 3]\n",
      "['Harlingen', 3]\n",
      "['Yuma', 3]\n",
      "['Duluth', 3]\n",
      "['Bush Field', 3]\n",
      "['Melbourne', 3]\n",
      "['Gwinn', 3]\n",
      "['Durango', 3]\n",
      "['College Station', 3]\n",
      "['New Bern', 3]\n",
      "['Brownsville', 3]\n",
      "['Farmington', 3]\n",
      "['Plattsburgh', 3]\n",
      "['Santa Fe', 3]\n",
      "['Cheyenne', 3]\n",
      "['Tyler', 3]\n",
      "['Casper', 3]\n",
      "['Great Falls', 3]\n",
      "['Daytona Beach', 3]\n",
      "['Toledo', 3]\n",
      "['La Crosse', 3]\n",
      "['Appleton', 3]\n",
      "['Idaho Falls', 3]\n",
      "['MONTGOMERY', 3]\n",
      "['Page', 3]\n",
      "['Kalispell', 3]\n",
      "['Saginaw', 3]\n",
      "['Missoula', 3]\n",
      "['Liberal', 3]\n",
      "['South Bend', 3]\n",
      "['Jacksonville NC', 3]\n",
      "['Dodge City', 3]\n",
      "['Grand Island', 3]\n",
      "['Huntington', 3]\n",
      "['Pierre', 3]\n",
      "['San Luis Obispo', 3]\n",
      "['Worland', 3]\n",
      "['Pasco', 3]\n",
      "['Chadron', 3]\n",
      "['Alliance', 3]\n",
      "['Alamosa', 3]\n",
      "['Show Low', 3]\n",
      "['Unalakleet', 3]\n",
      "['Baker Lake', 2]\n",
      "['Campbell River', 2]\n",
      "['Cambridge Bay', 2]\n",
      "['Nanaimo', 2]\n",
      "['Coppermine', 2]\n",
      "['Clyde River', 2]\n",
      "['Coral Harbour', 2]\n",
      "['Deer Lake', 2]\n",
      "['Eskimo Point', 2]\n",
      "['Inuvik', 2]\n",
      "['Iqaluit', 2]\n",
      "['Gjoa Haven', 2]\n",
      "['Hay River', 2]\n",
      "['Pond Inlet', 2]\n",
      "['Kamloops', 2]\n",
      "['Prince Pupert', 2]\n",
      "['Red Deer Industrial', 2]\n",
      "['Grande Prairie', 2]\n",
      "['Rankin Inlet', 2]\n",
      "['Cape Dorset', 2]\n",
      "['Hall Beach', 2]\n",
      "['Broughton Island', 2]\n",
      "['Norman Wells', 2]\n",
      "['Williams Lake', 2]\n",
      "['Cranbrook', 2]\n",
      "['Fort Saint John', 2]\n",
      "['Pangnirtung', 2]\n",
      "['Prince George', 2]\n",
      "['Whitehorse', 2]\n",
      "['North Bay', 2]\n",
      "['Smithers', 2]\n",
      "['Charlottetown', 2]\n",
      "['Spence Bay', 2]\n",
      "['Longview', 2]\n",
      "['Juneau', 2]\n",
      "['Garden City', 2]\n",
      "['Helena', 2]\n",
      "['Nantucket', 2]\n",
      "['Atlantic City', 2]\n",
      "['Lincoln', 2]\n",
      "['Williamsport', 2]\n",
      "['Carlsbad', 2]\n",
      "['Beaumont', 2]\n",
      "['Nome', 2]\n",
      "['Niagara Falls', 2]\n",
      "['Salisbury', 2]\n",
      "['Williston', 2]\n",
      "['Wichita Falls', 2]\n",
      "['Kotzebue', 2]\n",
      "['Waco', 2]\n",
      "['San Angelo', 2]\n",
      "['Abilene', 2]\n",
      "['Roswell', 2]\n",
      "['Sioux City', 2]\n",
      "['Texarkana', 2]\n",
      "['Lanai', 2]\n",
      "['Florence', 2]\n",
      "['New Haven', 2]\n",
      "['Jacksn Hole', 2]\n",
      "['Champaign', 2]\n",
      "['Manhattan', 2]\n",
      "['Saint George', 2]\n",
      "['Lawton', 2]\n",
      "['Flagstaff', 2]\n",
      "['Saint Cloud', 2]\n",
      "['Gillette', 2]\n",
      "['Cody', 2]\n",
      "['Joplin', 2]\n",
      "['Dubuque IA', 2]\n",
      "['Chesterfield Inlet', 2]\n",
      "['Igloolik', 2]\n",
      "['Whale Cove', 2]\n",
      "['Clarksburg', 2]\n",
      "['Lynchburg', 2]\n",
      "['North Bend', 2]\n",
      "['Owensboro', 2]\n",
      "['Rock Springs', 2]\n",
      "['Santa Maria', 2]\n",
      "['Aniak', 2]\n",
      "['Gambell', 2]\n",
      "['Kivalina', 2]\n",
      "['Shishmaref', 2]\n",
      "['Savoonga', 2]\n",
      "['Noatak', 2]\n",
      "['Hagerstown', 2]\n",
      "['Deering', 2]\n",
      "['Branson', 2]\n",
      "['Dickinson', 2]\n",
      "['Shungnak', 2]\n",
      "['Ambler', 2]\n",
      "['Buckland', 2]\n",
      "['Kiana', 2]\n",
      "['Kobuk', 2]\n",
      "['Noorvik', 2]\n",
      "['Selawik', 2]\n",
      "['Brevig Mission', 2]\n",
      "['Elim', 2]\n",
      "['Golovin', 2]\n",
      "['Teller', 2]\n",
      "['Wales', 2]\n",
      "['White Mountain', 2]\n",
      "['Koyuk', 2]\n",
      "['St. Michael', 2]\n",
      "['Shaktoolik', 2]\n",
      "['Panama City', 2]\n",
      "['Hilton Head Island', 2]\n",
      "['Baie Comeau', 1]\n",
      "['Bagotville', 1]\n",
      "['Brandon', 1]\n",
      "['Castlegar', 1]\n",
      "['Fredericton', 1]\n",
      "['Flin Flon', 1]\n",
      "['Fort Simpson', 1]\n",
      "['Kingston', 1]\n",
      "['Gaspe', 1]\n",
      "['Iles De La Madeleine', 1]\n",
      "['Dryden', 1]\n",
      "['Holman Island', 1]\n",
      "['Hamilton', 1]\n",
      "['Fort Chipewyan', 1]\n",
      "['Kenora', 1]\n",
      "['Lethbridge', 1]\n",
      "['Gander', 1]\n",
      "['Sydney', 1]\n",
      "['Quesnel', 1]\n",
      "['Resolute', 1]\n",
      "['St. John', 1]\n",
      "['Thompson', 1]\n",
      "['Repulse Bay', 1]\n",
      "['Rouyn', 1]\n",
      "[\"Val D'or\", 1]\n",
      "['Quujjuaq', 1]\n",
      "['Wabush', 1]\n",
      "['Medicine Hat', 1]\n",
      "['Sioux Lookout', 1]\n",
      "['Abbotsford', 1]\n",
      "['Penticton', 1]\n",
      "['Churchill', 1]\n",
      "['Goose Bay', 1]\n",
      "['Kapuskasing', 1]\n",
      "['Mont Joli', 1]\n",
      "['Sandspit', 1]\n",
      "['Sarnia', 1]\n",
      "['Port Hardy', 1]\n",
      "['Sept-iles', 1]\n",
      "['Barter Island', 1]\n",
      "['Cape Lisburne', 1]\n",
      "['Point Lay', 1]\n",
      "['Fort Yukon', 1]\n",
      "['St. Paul Island', 1]\n",
      "['Point Barrow', 1]\n",
      "['Iliamna', 1]\n",
      "['Prescott', 1]\n",
      "['Trenton', 1]\n",
      "['Dillingham', 1]\n",
      "['Harrison', 1]\n",
      "['Pueblo', 1]\n",
      "['Presque Isle', 1]\n",
      "['Kodiak', 1]\n",
      "['International Falls', 1]\n",
      "['Massena', 1]\n",
      "['Barrow', 1]\n",
      "['Bethel', 1]\n",
      "['Havre', 1]\n",
      "['Cordova', 1]\n",
      "['St. Petersburg', 1]\n",
      "['Deadhorse', 1]\n",
      "['Teterboro', 1]\n",
      "['Kenai', 1]\n",
      "['Hibbing', 1]\n",
      "['Homer', 1]\n",
      "['Fort Leonardwood', 1]\n",
      "['Imperial', 1]\n",
      "['Altoona', 1]\n",
      "['El Dorado', 1]\n",
      "['Augusta', 1]\n",
      "['Molokai', 1]\n",
      "['Chico', 1]\n",
      "['Ogdensburg', 1]\n",
      "['Dothan', 1]\n",
      "['Hobbs', 1]\n",
      "['Galena', 1]\n",
      "['Bellingham', 1]\n",
      "['Belleville', 1]\n",
      "['King Salmon', 1]\n",
      "['Stockton', 1]\n",
      "['Ketchikan', 1]\n",
      "['Modesto', 1]\n",
      "['Cedar City', 1]\n",
      "['Fairbanks', 1]\n",
      "['Topeka', 1]\n",
      "['Cold Bay', 1]\n",
      "['Valdez', 1]\n",
      "['Youngstown', 1]\n",
      "['Lewiston', 1]\n",
      "['Butte', 1]\n",
      "['Bar Harbor', 1]\n",
      "['Rockland', 1]\n",
      "['Rockford', 1]\n",
      "['Franklin', 1]\n",
      "['Redding', 1]\n",
      "['PARKERSBURG', 1]\n",
      "['PADUCAH', 1]\n",
      "['Sanford', 1]\n",
      "['Johnstown', 1]\n",
      "['Vail', 1]\n",
      "['Twin Falls', 1]\n",
      "['Vineyard Haven MA', 1]\n",
      "['Columbus Mississippi', 1]\n",
      "['Barnstable', 1]\n",
      "['Morgantown', 1]\n",
      "['Bemidji', 1]\n",
      "['Cortez', 1]\n",
      "['Hayden', 1]\n",
      "['Arcata CA', 1]\n",
      "['Anahim Lake', 1]\n",
      "['Fort Frances', 1]\n",
      "['Kimmirut', 1]\n",
      "['Powell River', 1]\n",
      "['The Pas', 1]\n",
      "['Red Lake', 1]\n",
      "['Bathurst', 1]\n",
      "['Masset', 1]\n",
      "['Aberdeen', 1]\n",
      "['Athens', 1]\n",
      "['Alpena', 1]\n",
      "['Bradford', 1]\n",
      "['Scottsbluff', 1]\n",
      "['Beckley', 1]\n",
      "['Brunswick', 1]\n",
      "['Crescent City', 1]\n",
      "['Cape Girardeau', 1]\n",
      "['Sault Ste Marie', 1]\n",
      "['Port Angeles', 1]\n",
      "['Hancock', 1]\n",
      "['Du Bois', 1]\n",
      "['Eau Claire', 1]\n",
      "['Elko', 1]\n",
      "['New Bedford', 1]\n",
      "['Glasgow', 1]\n",
      "['Hot Springs', 1]\n",
      "['Kirksville', 1]\n",
      "['Laramie', 1]\n",
      "['Latrobe', 1]\n",
      "['North Platte', 1]\n",
      "['Lebanon', 1]\n",
      "['Klamath Falls', 1]\n",
      "['Lancaster', 1]\n",
      "['Muskegon', 1]\n",
      "['Pocatello', 1]\n",
      "['Pellston', 1]\n",
      "['Portsmouth', 1]\n",
      "['Rhinelander', 1]\n",
      "['Rutland', 1]\n",
      "['Sheridan', 1]\n",
      "['Saranac Lake', 1]\n",
      "['Salina', 1]\n",
      "['Quincy', 1]\n",
      "['Valdosta', 1]\n",
      "['Gustavus', 1]\n",
      "['Skagway', 1]\n",
      "['Holy Cross', 1]\n",
      "['Haines', 1]\n",
      "['Kalskag', 1]\n",
      "['Mcgrath', 1]\n",
      "['Mountain Village', 1]\n",
      "['Chevak', 1]\n",
      "['Worcester', 1]\n",
      "['Provincetown', 1]\n",
      "['Mesa', 1]\n",
      "['Anvik', 1]\n",
      "['Atqasuk', 1]\n",
      "['Hooper Bay', 1]\n",
      "['Kaltag', 1]\n",
      "[\"St Mary's\", 1]\n",
      "['Mekoryuk', 1]\n",
      "['Ruby', 1]\n",
      "['Bella Coola', 1]\n",
      "['Sand Point', 1]\n",
      "['Togiak Village', 1]\n",
      "['Escanaba', 1]\n",
      "['Marion', 1]\n",
      "['Iron Mountain', 1]\n",
      "['Montrose CO', 1]\n",
      "['Riverton WY', 1]\n",
      "['Pendleton', 1]\n",
      "['Brainerd', 1]\n",
      "['Lewisburg', 1]\n",
      "['Chefornak', 1]\n",
      "['St. Augustine Airport', 1]\n",
      "['Santa Rosa', 1]\n",
      "['Aspen', 1]\n",
      "['Thief River Falls', 1]\n",
      "['Gunnison', 1]\n",
      "['Punta Gorda', 1]\n",
      "['Jamestown', 1]\n",
      "['Weyers Cave', 1]\n",
      "['Sidney', 1]\n",
      "['McCook', 1]\n",
      "['Glendive', 1]\n",
      "['Wolf Point', 1]\n",
      "['Moab', 1]\n",
      "['Vernal', 1]\n",
      "['Mammoth Lakes', 1]\n",
      "['Friday Harbor', 1]\n",
      "['Eastsound', 1]\n",
      "['Emmonak', 1]\n",
      "['Shageluk', 1]\n",
      "['Nuiqsut', 1]\n",
      "['Eek', 1]\n",
      "['Kwethluk', 1]\n",
      "['Kwigillingok', 1]\n",
      "['Marshall', 1]\n",
      "['Russian Mission', 1]\n",
      "['Huslia', 1]\n",
      "['Nulato', 1]\n",
      "['Visalia', 1]\n",
      "['Merced', 1]\n",
      "['Hoonah', 1]\n",
      "['Tin City', 1]\n",
      "['Alakanuk', 1]\n",
      "['Kipnuk', 1]\n",
      "['Quinhagak', 1]\n",
      "['Kotlik', 1]\n",
      "['Koyukuk', 1]\n",
      "['Scammon Bay', 1]\n",
      "['Kongiganak', 1]\n",
      "['Wainwright', 1]\n",
      "['Sleetmute', 1]\n",
      "['Provo', 1]\n",
      "['Los Alamos', 1]\n",
      "['Nightmute', 1]\n",
      "['Toksook Bay', 1]\n",
      "['Trail', 1]\n",
      "['Arctic Bay', 1]\n",
      "['Ogden', 1]\n"
     ]
    }
   ],
   "source": [
    "read_TopKCities_w_MostAirlines()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "#top k cities with most airlines\n",
    "#MATCH (p:Airport)-[r:Route]->(p2:Airport)\n",
    "#WITH p.city AS City, COLLECT(DISTINCT r.airline_name) AS Airlines\n",
    "#WITH City, Airlines, SIZE(Airlines) AS numofAirlines\n",
    "#ORDER BY numofAirlines DESC\n",
    "#LIMIT 10\n",
    "#RETURN City, Airlines, numofAirlines*/\n",
    "def read_TopKCities_w_MostAirlines2():\n",
    "    city_airlines = {}\n",
    "    airport_to_city = {}\n",
    "\n",
    "    with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "        driver.verify_connectivity()\n",
    "        records, summary, keys = driver.execute_query(\n",
    "            \"\"\" \n",
    "            MATCH (p:Airport)\n",
    "            RETURN p.airport_id as Airport_ID, p.city AS City\n",
    "            \"\"\",\n",
    "            database_=\"neo4j\", )\n",
    "        for record in records: \n",
    "            #print(record.data())\n",
    "            airport_id = record.data()['Airport_ID']\n",
    "            city = record.data()['City']\n",
    "            airport_to_city[airport_id] = city\n",
    "\n",
    "        records, summary, keys = driver.execute_query(\n",
    "            \"\"\" \n",
    "            MATCH (p:Airport)-[r:Route]->(p2:Airport)\n",
    "            RETURN r.airline_name as Airline_Name, p.airport_id as Source_airport_id, p2.airport_id as Dest_airport_id\n",
    "            \"\"\",\n",
    "            database_=\"neo4j\", )\n",
    "        for record in records: \n",
    "            #print(record.data())\n",
    "            airline_name = record.data()['Airline_Name']\n",
    "            source_airport_id = record.data()['Source_airport_id']\n",
    "            dest_airport_id = record.data()['Dest_airport_id']\n",
    "\n",
    "            source_city = airport_to_city.get(source_airport_id, \"Unknown\")\n",
    "            dest_city = airport_to_city.get(dest_airport_id, \"Unknown\")\n",
    "\n",
    "            if source_city != \"Unknown\":\n",
    "                if source_city not in city_airlines:\n",
    "                    city_airlines[source_city] = set()\n",
    "                city_airlines[source_city].add(airline_name)\n",
    "\n",
    "            if dest_city != \"Unknown\": \n",
    "                if dest_city not in city_airlines:\n",
    "                    city_airlines[dest_city] = set()\n",
    "                city_airlines[dest_city].add(airline_name)\n",
    "    sorted_cities = sorted(city_airlines.items(), key=lambda item: len(item[1]), reverse=True)\n",
    "    #print(sorted_cities)\n",
    "    for city, airlines in sorted_cities:\n",
    "        airlines = list(airlines)\n",
    "        sorted_airlines = sorted(airlines)\n",
    "        print(f\"{city}, {sorted_airlines}, {len(sorted_airlines)}\")\n",
    "\n",
    "    driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Los Angeles, ['4B', 'AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'G4', 'HA', 'NK', 'SY', 'UA', 'US', 'VX', 'WN', 'WS', 'ZK'], 17\n",
      "Las Vegas, ['4B', 'AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'G4', 'HA', 'NK', 'SY', 'UA', 'US', 'VX', 'WN', 'WS'], 16\n",
      "San Diego, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'G4', 'HA', 'K5', 'NK', 'SY', 'UA', 'US', 'VX', 'WN', 'WS'], 16\n",
      "New York, ['9E', 'AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'HA', 'NK', 'SY', 'UA', 'US', 'VX', 'WN', 'WS'], 15\n",
      "Phoenix, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'HA', 'NK', 'SY', 'UA', 'US', 'WN', 'WS', 'ZK'], 14\n",
      "Chicago, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'NK', 'PD', 'SY', 'UA', 'US', 'VX', 'WN', 'WS'], 14\n",
      "Orlando, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'NK', 'SY', 'TS', 'UA', 'US', 'VX', 'WN', 'WS'], 14\n",
      "Boston, ['9K', 'AA', 'AC', 'B6', 'DL', 'FL', 'KS', 'NK', 'PD', 'SY', 'UA', 'US', 'VX', 'WN'], 14\n",
      "Fort Lauderdale, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'G4', 'NK', 'TS', 'UA', 'US', 'VX', 'WN', 'WS'], 14\n",
      "San Francisco, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'HA', 'SY', 'UA', 'US', 'VX', 'WN', 'WS'], 13\n",
      "Dallas-Fort Worth, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'NK', 'SY', 'UA', 'US', 'VX', 'WN', 'WS'], 13\n",
      "Minneapolis, ['9E', 'AA', 'AC', 'DL', 'F9', 'FL', 'NK', 'SY', 'UA', 'US', 'WN', 'WS', 'ZK'], 13\n",
      "Washington, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'LW', 'PD', 'SY', 'UA', 'US', 'VX', 'WN'], 13\n",
      "Seattle, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'HA', 'M5', 'SY', 'UA', 'US', 'VX', 'WN'], 13\n",
      "Portland, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'HA', 'K5', 'NK', 'UA', 'US', 'VX', 'WN'], 13\n",
      "Detroit, ['9E', 'AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'NK', 'UA', 'US', 'WN', 'WS'], 12\n",
      "Fort Myers, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'NK', 'SY', 'UA', 'US', 'WN', 'WS'], 12\n",
      "New Orleans, ['9E', 'AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'NK', 'UA', 'US', 'WN', 'WS'], 12\n",
      "Vancouver, ['4N', '8P', 'AA', 'AC', 'BH', 'DL', 'JB', 'TS', 'UA', 'US', 'WS'], 11\n",
      "Edmonton, ['4N', '5T', '7F', 'AA', 'AC', 'DL', 'J3', 'TS', 'UA', 'US', 'WS'], 11\n",
      "Houston, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'LW', 'NK', 'UA', 'US', 'WN'], 11\n",
      "Denver, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'NK', 'UA', 'US', 'WN', 'ZK'], 11\n",
      "Atlanta, ['9E', 'AA', 'AC', 'DL', 'F9', 'FL', 'NK', 'UA', 'US', 'WN', 'WS'], 11\n",
      "Tampa, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'NK', 'UA', 'US', 'WN', 'WS'], 11\n",
      "Ottawa, ['4N', '5T', '7F', 'AA', 'AC', 'DL', 'PD', 'UA', 'US', 'WS'], 10\n",
      "Newark, ['AA', 'AC', 'B6', 'DL', 'FL', 'PD', 'UA', 'US', 'VX', 'WN'], 10\n",
      "Philadelphia, ['AA', 'AC', 'B6', 'DL', 'FL', 'NK', 'UA', 'US', 'VX', 'WN'], 10\n",
      "Austin, ['AA', 'B6', 'DL', 'F9', 'FL', 'G4', 'UA', 'US', 'VX', 'WN'], 10\n",
      "Montreal, ['7F', 'AA', 'AC', 'DL', 'PD', 'TS', 'UA', 'US', 'WS'], 9\n",
      "Charlotte, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'UA', 'US', 'WN'], 9\n",
      "Honolulu, ['AA', 'AC', 'DL', 'G4', 'HA', 'UA', 'US', 'WP', 'WS'], 9\n",
      "Cincinnati, ['9E', 'AA', 'AC', 'DL', 'F9', 'G4', 'UA', 'US', 'WS'], 9\n",
      "St. Louis, ['9K', 'AA', 'AC', 'DL', 'F9', 'FL', 'UA', 'US', 'WN'], 9\n",
      "Rochester, ['AA', 'AC', 'B6', 'DL', 'FL', 'G4', 'UA', 'US', 'WN'], 9\n",
      "Raleigh-durham, ['AA', 'AC', 'B6', 'DL', 'F9', 'FL', 'UA', 'US', 'WN'], 9\n",
      "Kansas City, ['AA', 'AC', 'DL', 'F9', 'FL', 'K5', 'UA', 'US', 'WN'], 9\n",
      "Baltimore, ['AA', 'AC', 'B6', 'DL', 'FL', 'NK', 'UA', 'US', 'WN'], 9\n",
      "Nashville, ['AA', 'AC', 'DL', 'F9', 'FL', 'K5', 'UA', 'US', 'WN'], 9\n",
      "Charleston, ['9E', 'AA', 'B6', 'DL', 'FL', 'NK', 'UA', 'US', 'WN'], 9\n",
      "San Jose, ['AA', 'B6', 'DL', 'FL', 'HA', 'UA', 'US', 'VX', 'WN'], 9\n",
      "Oakland, ['AA', 'B6', 'DL', 'FL', 'G4', 'HA', 'NK', 'US', 'WN'], 9\n",
      "Memphis, ['9E', 'AA', 'DL', 'F9', 'FL', 'K5', 'UA', 'US', 'WN'], 9\n",
      "Toronto, ['AA', 'AC', 'DL', 'PD', 'TS', 'UA', 'US', 'WS'], 8\n",
      "Calgary, ['4N', 'AA', 'AC', 'DL', 'TS', 'UA', 'US', 'WS'], 8\n",
      "Halifax, ['AA', 'AC', 'DL', 'PD', 'TS', 'UA', 'US', 'WS'], 8\n",
      "Palm Springs, ['AA', 'DL', 'F9', 'G4', 'SY', 'UA', 'US', 'WS'], 8\n",
      "Myrtle Beach, ['AA', 'DL', 'G4', 'NK', 'PD', 'UA', 'US', 'WS'], 8\n",
      "Windsor Locks, ['AA', 'AC', 'B6', 'DL', 'FL', 'UA', 'US', 'WN'], 8\n",
      "Santa Ana, ['AA', 'DL', 'F9', 'FL', 'UA', 'US', 'WN', 'WS'], 8\n",
      "Kahului, ['AA', 'AC', 'DL', 'HA', 'UA', 'US', 'WP', 'WS'], 8\n",
      "Salt Lake City, ['AA', 'B6', 'DL', 'F9', 'FL', 'UA', 'US', 'WN'], 8\n",
      "Pittsburgh, ['AA', 'AC', 'B6', 'DL', 'FL', 'UA', 'US', 'WN'], 8\n",
      "Columbus, ['AA', 'AC', 'DL', 'FL', 'G4', 'UA', 'US', 'WN'], 8\n",
      "Cleveland, ['AA', 'AC', 'DL', 'F9', 'FL', 'UA', 'US', 'WN'], 8\n",
      "Syracuse, ['9E', 'AA', 'AC', 'B6', 'DL', 'G4', 'UA', 'US'], 8\n",
      "Milwaukee, ['AA', 'AC', 'DL', 'F9', 'FL', 'UA', 'US', 'WN'], 8\n",
      "Harrisburg, ['9E', 'AA', 'AC', 'DL', 'F9', 'G4', 'UA', 'US'], 8\n",
      "Indianapolis, ['AA', 'AC', 'DL', 'F9', 'FL', 'UA', 'US', 'WN'], 8\n",
      "Burbank, ['AA', 'B6', 'DL', 'FL', 'K5', 'UA', 'US', 'WN'], 8\n",
      "Albuquerque, ['AA', 'B6', 'DL', 'FL', 'LW', 'UA', 'US', 'WN'], 8\n",
      "Oklahoma City, ['AA', 'DL', 'F9', 'FL', 'G4', 'UA', 'US', 'WN'], 8\n",
      "Sacramento, ['AA', 'B6', 'DL', 'FL', 'HA', 'UA', 'US', 'WN'], 8\n",
      "Little Rock, ['AA', 'DL', 'F9', 'FL', 'G4', 'UA', 'US', 'WN'], 8\n",
      "Des Moines, ['AA', 'DL', 'F9', 'FL', 'G4', 'UA', 'US', 'WN'], 8\n",
      "Greenville, ['9E', 'AA', 'DL', 'FL', 'G4', 'UA', 'US', 'WN'], 8\n",
      "Winnipeg, ['5T', '7F', 'AC', 'DL', 'JV', 'UA', 'WS'], 7\n",
      "Quebec, ['AA', 'AC', 'PD', 'TS', 'UA', 'US', 'WS'], 7\n",
      "Lihue, ['AA', 'DL', 'HA', 'UA', 'US', 'WP', 'WS'], 7\n",
      "Anchorage, ['7H', 'AA', 'DL', 'KO', 'KS', 'UA', 'US'], 7\n",
      "Richmond, ['AA', 'B6', 'DL', 'FL', 'UA', 'US', 'WN'], 7\n",
      "Buffalo, ['AA', 'B6', 'DL', 'FL', 'UA', 'US', 'WN'], 7\n",
      "Jacksonville, ['AA', 'B6', 'DL', 'FL', 'UA', 'US', 'WN'], 7\n",
      "West Palm Beach, ['AA', 'B6', 'DL', 'FL', 'UA', 'US', 'WN'], 7\n",
      "Albany, ['9K', 'AA', 'DL', 'FL', 'UA', 'US', 'WN'], 7\n",
      "Spokane, ['AA', 'DL', 'F9', 'FL', 'UA', 'US', 'WN'], 7\n",
      "Boise, ['AA', 'DL', 'FL', 'G4', 'UA', 'US', 'WN'], 7\n",
      "Omaha, ['AA', 'DL', 'F9', 'FL', 'UA', 'US', 'WN'], 7\n",
      "Wichita, ['AA', 'DL', 'FL', 'G4', 'UA', 'US', 'WN'], 7\n",
      "Tulsa, ['AA', 'DL', 'FL', 'G4', 'UA', 'US', 'WN'], 7\n",
      "Reno, ['AA', 'DL', 'FL', 'G4', 'UA', 'US', 'WN'], 7\n",
      "Jackson, ['AA', 'DL', 'FL', 'K5', 'UA', 'US', 'WN'], 7\n",
      "Grand Rapids, ['AA', 'DL', 'FL', 'G4', 'UA', 'US', 'WN'], 7\n",
      "Knoxville, ['9E', 'AA', 'DL', 'F9', 'G4', 'UA', 'US'], 7\n",
      "Providence, ['AA', 'B6', 'DL', 'FL', 'UA', 'US', 'WN'], 7\n",
      "Greensboro, ['9E', 'AA', 'DL', 'F9', 'G4', 'UA', 'US'], 7\n",
      "White Plains, ['9K', 'AA', 'B6', 'DL', 'TJ', 'UA', 'US'], 7\n",
      "Cedar Rapids, ['9E', 'AA', 'DL', 'F9', 'G4', 'UA', 'US'], 7\n",
      "Yellowknife, ['4N', '5T', '7F', 'AC', 'J3', 'WS'], 6\n",
      "Victoria, ['8P', 'AC', 'JB', 'LW', 'UA', 'WS'], 6\n",
      "Kelowna, ['4N', '8P', 'AC', 'J3', 'UA', 'WS'], 6\n",
      "Miami, ['AA', 'AC', 'DL', 'UA', 'US', 'WS'], 6\n",
      "Kona, ['AA', 'DL', 'HA', 'UA', 'US', 'WS'], 6\n",
      "Akron, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Islip, ['AA', 'FL', 'G4', 'KS', 'US', 'WN'], 6\n",
      "Ontario, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Eugene, ['AA', 'DL', 'F9', 'G4', 'UA', 'US'], 6\n",
      "Louisville, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "San Antonio, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "El Paso, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Tucson, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Fresno, ['AA', 'DL', 'F9', 'G4', 'UA', 'US'], 6\n",
      "Norfolk, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Bentonville, ['9E', 'AA', 'DL', 'G4', 'UA', 'US'], 6\n",
      "Flint, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Dayton, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Manchester NH, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Burlington, ['AA', 'B6', 'DL', 'G4', 'UA', 'US'], 6\n",
      "Birmingham, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Fort Wayne, ['9E', 'AA', 'DL', 'G4', 'UA', 'US'], 6\n",
      "Lexington KY, ['9E', 'AA', 'DL', 'G4', 'UA', 'US'], 6\n",
      "Key West, ['AA', 'DL', 'FL', 'UA', 'US', 'WN'], 6\n",
      "Fargo, ['AA', 'DL', 'F9', 'G4', 'UA', 'US'], 6\n",
      "Sioux Falls, ['AA', 'DL', 'F9', 'G4', 'UA', 'US'], 6\n",
      "Roanoke VA, ['9E', 'AA', 'DL', 'G4', 'UA', 'US'], 6\n",
      "St. John's, ['AC', 'PD', 'TS', 'UA', 'WS'], 5\n",
      "Moncton, ['AC', 'PD', 'TS', 'UA', 'WS'], 5\n",
      "Savannah, ['AA', 'B6', 'DL', 'UA', 'US'], 5\n",
      "Dallas, ['DL', 'FL', 'K5', 'UA', 'WN'], 5\n",
      "Madison, ['AA', 'DL', 'F9', 'UA', 'US'], 5\n",
      "Grand Junction, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Colorado Springs, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Amarillo, ['AA', 'FL', 'UA', 'US', 'WN'], 5\n",
      "Lubbock, ['AA', 'FL', 'UA', 'US', 'WN'], 5\n",
      "Midland, ['AA', 'FL', 'UA', 'US', 'WN'], 5\n",
      "Allentown, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Sarasota, ['AA', 'B6', 'DL', 'UA', 'US'], 5\n",
      "Pensacola, ['AA', 'DL', 'UA', 'US', 'WN'], 5\n",
      "Chattanooga, ['9E', 'AA', 'DL', 'G4', 'US'], 5\n",
      "Lansing, ['9E', 'DL', 'G4', 'SY', 'UA'], 5\n",
      "Asheville, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Newburgh, ['AA', 'B6', 'DL', 'G4', 'US'], 5\n",
      "Rapid City, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Shreveport, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Corpus Christi, ['AA', 'FL', 'UA', 'US', 'WN'], 5\n",
      "Elmira, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Moline, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Peoria, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Springfield, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Newport News, ['AA', 'DL', 'F9', 'G4', 'US'], 5\n",
      "Bloomington, ['AA', 'DL', 'F9', 'G4', 'US'], 5\n",
      "Scranton, ['AA', 'DL', 'G4', 'UA', 'US'], 5\n",
      "Thunder Bay, ['AC', 'JV', 'PD', 'WS'], 4\n",
      "Saskatoon, ['AC', 'DL', 'UA', 'WS'], 4\n",
      "Regina, ['AC', 'DL', 'UA', 'WS'], 4\n",
      "Fort Mcmurray, ['AC', 'J3', 'UA', 'WS'], 4\n",
      "Fort Smith, ['AA', 'DL', 'J3', 'US'], 4\n",
      "Long Beach, ['AA', 'B6', 'DL', 'US'], 4\n",
      "Santa Barbara, ['AA', 'F9', 'UA', 'US'], 4\n",
      "Monterey, ['AA', 'G4', 'UA', 'US'], 4\n",
      "Bangor, ['AA', 'DL', 'G4', 'US'], 4\n",
      "Redmond-Bend, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Medford, ['AA', 'DL', 'G4', 'UA'], 4\n",
      "Gainesville, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Erie, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Lafayette, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Ithaca, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Minot, ['DL', 'F9', 'G4', 'UA'], 4\n",
      "Valparaiso, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Tallahassee, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Wilmington, ['AA', 'DL', 'F9', 'US'], 4\n",
      "Huntsville, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Fayetteville, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Columbia, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Bozeman, ['DL', 'F9', 'G4', 'UA'], 4\n",
      "Billings, ['9K', 'DL', 'G4', 'UA'], 4\n",
      "Mobile, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Monroe, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Mcallen, ['AA', 'G4', 'UA', 'US'], 4\n",
      "Laredo, ['AA', 'G4', 'UA', 'US'], 4\n",
      "Killeen, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Gulfport, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Baton Rouge, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Alexandria, ['AA', 'DL', 'UA', 'US'], 4\n",
      "BRISTOL, ['AA', 'DL', 'G4', 'US'], 4\n",
      "Traverse City, ['AA', 'DL', 'UA', 'US'], 4\n",
      "State College Pennsylvania, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Green Bay, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Evansville, ['9E', 'AA', 'DL', 'US'], 4\n",
      "Wassau, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Binghamton, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Kalamazoo, ['9E', 'AA', 'DL', 'US'], 4\n",
      "Charlottesville VA, ['AA', 'DL', 'UA', 'US'], 4\n",
      "Bismarck, ['DL', 'F9', 'G4', 'UA'], 4\n",
      "Watertown, ['AA', 'F9', 'US', 'ZK'], 4\n",
      "Sault Sainte Marie, ['AC', 'JV', 'PD'], 3\n",
      "Sudbury, ['AC', 'JV', 'PD'], 3\n",
      "Comox, ['8P', 'AC', 'WS'], 3\n",
      "Waterloo, ['AA', 'US', 'WS'], 3\n",
      "London, ['AC', 'UA', 'WS'], 3\n",
      "Windsor, ['AC', 'PD', 'WS'], 3\n",
      "Timmins, ['AC', 'JV', 'PD'], 3\n",
      "Terrace, ['AC', 'BH', 'WS'], 3\n",
      "Hilo, ['HA', 'UA', 'US'], 3\n",
      "Grand Forks, ['9E', 'DL', 'G4'], 3\n",
      "Plattsburgh, ['G4', 'KS', 'NK'], 3\n",
      "Bakersfield, ['AA', 'UA', 'US'], 3\n",
      "Show Low, ['F9', 'UA', 'ZK'], 3\n",
      "Page, ['F9', 'UA', 'ZK'], 3\n",
      "Yuma, ['AA', 'UA', 'US'], 3\n",
      "San Luis Obispo, ['AA', 'UA', 'US'], 3\n",
      "Durango, ['AA', 'UA', 'US'], 3\n",
      "Pasco, ['DL', 'G4', 'UA'], 3\n",
      "Santa Fe, ['AA', 'UA', 'US'], 3\n",
      "Huron, ['F9', 'UA', 'ZK'], 3\n",
      "Pierre, ['F9', 'UA', 'ZK'], 3\n",
      "Harlingen, ['FL', 'UA', 'WN'], 3\n",
      "Lake Charles, ['AA', 'UA', 'US'], 3\n",
      "Huntington, ['AA', 'G4', 'US'], 3\n",
      "Jacksonville NC, ['AA', 'DL', 'US'], 3\n",
      "Bush Field, ['AA', 'DL', 'US'], 3\n",
      "Missoula, ['DL', 'G4', 'UA'], 3\n",
      "Idaho Falls, ['DL', 'G4', 'UA'], 3\n",
      "Great Falls, ['DL', 'G4', 'UA'], 3\n",
      "Kalispell, ['DL', 'G4', 'UA'], 3\n",
      "Casper, ['DL', 'G4', 'UA'], 3\n",
      "Tyler, ['AA', 'UA', 'US'], 3\n",
      "College Station, ['AA', 'UA', 'US'], 3\n",
      "Brownsville, ['AA', 'UA', 'US'], 3\n",
      "Duluth, ['DL', 'G4', 'UA'], 3\n",
      "Unalakleet, ['7H', '8E', 'KS'], 3\n",
      "South Bend, ['DL', 'G4', 'UA'], 3\n",
      "Toledo, ['AA', 'G4', 'US'], 3\n",
      "Gwinn, ['AA', 'DL', 'US'], 3\n",
      "Saginaw, ['9E', 'DL', 'UA'], 3\n",
      "Appleton, ['DL', 'G4', 'UA'], 3\n",
      "MONTGOMERY, ['AA', 'DL', 'US'], 3\n",
      "Grand Island, ['AA', 'G4', 'US'], 3\n",
      "Melbourne, ['AA', 'DL', 'US'], 3\n",
      "New Bern, ['AA', 'DL', 'US'], 3\n",
      "Daytona Beach, ['AA', 'DL', 'US'], 3\n",
      "Farmington, ['F9', 'UA', 'ZK'], 3\n",
      "Alamosa, ['F9', 'UA', 'ZK'], 3\n",
      "Liberal, ['F9', 'UA', 'ZK'], 3\n",
      "Dodge City, ['F9', 'UA', 'ZK'], 3\n",
      "Cheyenne, ['F9', 'UA', 'ZK'], 3\n",
      "Alliance, ['F9', 'UA', 'ZK'], 3\n",
      "Worland, ['F9', 'UA', 'ZK'], 3\n",
      "La Crosse, ['AA', 'DL', 'US'], 3\n",
      "Chadron, ['F9', 'UA', 'ZK'], 3\n",
      "Baker Lake, ['5T', '7F'], 2\n",
      "Repulse Bay, ['5T', '7F'], 2\n",
      "Rankin Inlet, ['5T', '7F'], 2\n",
      "Whale Cove, ['5T', '7F'], 2\n",
      "Chesterfield Inlet, ['5T', '7F'], 2\n",
      "Campbell River, ['8P', 'AC'], 2\n",
      "Cambridge Bay, ['5T', '7F'], 2\n",
      "Gjoa Haven, ['5T', '7F'], 2\n",
      "Coppermine, ['5T', '7F'], 2\n",
      "Spence Bay, ['5T', '7F'], 2\n",
      "Nanaimo, ['AC', 'WS'], 2\n",
      "Clyde River, ['5T', '7F'], 2\n",
      "Pond Inlet, ['5T', '7F'], 2\n",
      "Iqaluit, ['5T', '7F'], 2\n",
      "Coral Harbour, ['5T', '7F'], 2\n",
      "Cape Dorset, ['5T', '7F'], 2\n",
      "Deer Lake, ['AC', 'WS'], 2\n",
      "Hay River, ['7F', 'J3'], 2\n",
      "Grande Prairie, ['AC', 'WS'], 2\n",
      "Whitehorse, ['4N', 'AC'], 2\n",
      "Eskimo Point, ['5T', '7F'], 2\n",
      "Inuvik, ['5T', '7F'], 2\n",
      "Norman Wells, ['5T', '7F'], 2\n",
      "Pangnirtung, ['5T', '7F'], 2\n",
      "Hall Beach, ['5T', '7F'], 2\n",
      "Igloolik, ['5T', '7F'], 2\n",
      "Charlottetown, ['AC', 'WS'], 2\n",
      "Kamloops, ['AC', 'WS'], 2\n",
      "Red Deer Industrial, ['AC', 'J3'], 2\n",
      "Cranbrook, ['8P', 'AC'], 2\n",
      "Prince Pupert, ['AC', 'BH'], 2\n",
      "Williams Lake, ['8P', 'AC'], 2\n",
      "North Bay, ['AC', 'JV'], 2\n",
      "Broughton Island, ['5T', '7F'], 2\n",
      "Prince George, ['AC', 'WS'], 2\n",
      "Fort Saint John, ['AC', 'WS'], 2\n",
      "Smithers, ['AC', 'BH'], 2\n",
      "Kotzebue, ['7H', '8E'], 2\n",
      "Nantucket, ['9K', 'TJ'], 2\n",
      "Atlantic City, ['NK', 'UA'], 2\n",
      "Flagstaff, ['AA', 'US'], 2\n",
      "Longview, ['AA', 'US'], 2\n",
      "North Bend, ['K5', 'UA'], 2\n",
      "Santa Maria, ['G4', 'UA'], 2\n",
      "Carlsbad, ['LW', 'UA'], 2\n",
      "Juneau, ['AA', 'K5'], 2\n",
      "Garden City, ['AA', 'US'], 2\n",
      "Branson, ['F9', 'WN'], 2\n",
      "Helena, ['DL', 'UA'], 2\n",
      "Niagara Falls, ['G4', 'NK'], 2\n",
      "Hilton Head Island, ['AA', 'US'], 2\n",
      "Saint George, ['DL', 'UA'], 2\n",
      "Rock Springs, ['DL', 'UA'], 2\n",
      "Jacksn Hole, ['DL', 'UA'], 2\n",
      "Gillette, ['DL', 'UA'], 2\n",
      "Cody, ['DL', 'UA'], 2\n",
      "Lincoln, ['DL', 'UA'], 2\n",
      "Panama City, ['DL', 'WN'], 2\n",
      "Williamsport, ['AA', 'US'], 2\n",
      "Beaumont, ['AA', 'US'], 2\n",
      "Nome, ['7H', '8E'], 2\n",
      "White Mountain, ['7H', '8E'], 2\n",
      "Teller, ['7H', '8E'], 2\n",
      "Savoonga, ['7H', '8E'], 2\n",
      "Shishmaref, ['7H', '8E'], 2\n",
      "Koyuk, ['7H', '8E'], 2\n",
      "Gambell, ['7H', '8E'], 2\n",
      "Elim, ['7H', '8E'], 2\n",
      "Wales, ['7H', '8E'], 2\n",
      "Shaktoolik, ['7H', '8E'], 2\n",
      "Brevig Mission, ['7H', '8E'], 2\n",
      "Golovin, ['7H', '8E'], 2\n",
      "Salisbury, ['AA', 'US'], 2\n",
      "Williston, ['DL', 'UA'], 2\n",
      "Texarkana, ['AA', 'US'], 2\n",
      "Wichita Falls, ['AA', 'US'], 2\n",
      "San Angelo, ['AA', 'US'], 2\n",
      "Roswell, ['AA', 'US'], 2\n",
      "Manhattan, ['AA', 'US'], 2\n",
      "Lawton, ['AA', 'US'], 2\n",
      "Joplin, ['AA', 'US'], 2\n",
      "Champaign, ['AA', 'US'], 2\n",
      "Waco, ['AA', 'US'], 2\n",
      "Abilene, ['AA', 'US'], 2\n",
      "Owensboro, ['9K', 'G4'], 2\n",
      "Noatak, ['7H', '8E'], 2\n",
      "Selawik, ['7H', '8E'], 2\n",
      "Shungnak, ['7H', '8E'], 2\n",
      "Noorvik, ['7H', '8E'], 2\n",
      "Kivalina, ['7H', '8E'], 2\n",
      "Kiana, ['7H', '8E'], 2\n",
      "Deering, ['7H', '8E'], 2\n",
      "Buckland, ['7H', '8E'], 2\n",
      "Ambler, ['7H', '8E'], 2\n",
      "Hagerstown, ['G4', 'LW'], 2\n",
      "Lanai, ['HA', 'WP'], 2\n",
      "Dickinson, ['DL', 'UA'], 2\n",
      "New Haven, ['AA', 'US'], 2\n",
      "Sioux City, ['AA', 'US'], 2\n",
      "Aniak, ['7H', 'KS'], 2\n",
      "Dubuque IA, ['AA', 'US'], 2\n",
      "Saint Cloud, ['G4', 'UA'], 2\n",
      "Lynchburg, ['AA', 'US'], 2\n",
      "Florence, ['AA', 'US'], 2\n",
      "Clarksburg, ['G4', 'UA'], 2\n",
      "St. Michael, ['7H', '8E'], 2\n",
      "Kobuk, ['7H', '8E'], 2\n",
      "Baie Comeau, ['AC'], 1\n",
      "Mont Joli, ['AC'], 1\n",
      "Bagotville, ['AC'], 1\n",
      "Brandon, ['WS'], 1\n",
      "Castlegar, ['AC'], 1\n",
      "Holman Island, ['7F'], 1\n",
      "Goose Bay, ['AC'], 1\n",
      "Abbotsford, ['WS'], 1\n",
      "Hamilton, ['WS'], 1\n",
      "Churchill, ['5T'], 1\n",
      "Quujjuaq, ['7F'], 1\n",
      "Kimmirut, ['7F'], 1\n",
      "Arctic Bay, ['7F'], 1\n",
      "Fredericton, ['AC'], 1\n",
      "Flin Flon, ['JV'], 1\n",
      "The Pas, ['JV'], 1\n",
      "Fort Simpson, ['7F'], 1\n",
      "Kingston, ['AC'], 1\n",
      "Gaspe, ['AC'], 1\n",
      "Iles De La Madeleine, ['AC'], 1\n",
      "Dryden, ['JV'], 1\n",
      "Sioux Lookout, ['JV'], 1\n",
      "Red Lake, ['JV'], 1\n",
      "Kenora, ['JV'], 1\n",
      "Gander, ['AC'], 1\n",
      "Sydney, ['AC'], 1\n",
      "St. John, ['AC'], 1\n",
      "Fort Chipewyan, ['J3'], 1\n",
      "Sept-iles, ['AC'], 1\n",
      "Fort Frances, ['JV'], 1\n",
      "Lethbridge, ['AC'], 1\n",
      "Quesnel, ['AC'], 1\n",
      "Resolute, ['7F'], 1\n",
      "Thompson, ['5T'], 1\n",
      "Kapuskasing, ['JV'], 1\n",
      "Bathurst, ['AC'], 1\n",
      "Val D'or, ['AC'], 1\n",
      "Rouyn, ['AC'], 1\n",
      "Sandspit, ['AC'], 1\n",
      "Penticton, ['AC'], 1\n",
      "Bella Coola, ['8P'], 1\n",
      "Powell River, ['8P'], 1\n",
      "Port Hardy, ['8P'], 1\n",
      "Trail, ['8P'], 1\n",
      "Masset, ['8P'], 1\n",
      "Wabush, ['AC'], 1\n",
      "Medicine Hat, ['AC'], 1\n",
      "Sarnia, ['AC'], 1\n",
      "Barter Island, ['7H'], 1\n",
      "Deadhorse, ['7H'], 1\n",
      "Fort Yukon, ['7H'], 1\n",
      "Cape Lisburne, ['8E'], 1\n",
      "Point Lay, ['7H'], 1\n",
      "Barrow, ['7H'], 1\n",
      "Fairbanks, ['7H'], 1\n",
      "St. Paul Island, ['KS'], 1\n",
      "Point Barrow, ['KS'], 1\n",
      "Iliamna, ['KO'], 1\n",
      "Sanford, ['G4'], 1\n",
      "Mesa, ['G4'], 1\n",
      "Thief River Falls, ['9E'], 1\n",
      "Prescott, ['ZK'], 1\n",
      "Trenton, ['F9'], 1\n",
      "St. Augustine Airport, ['F9'], 1\n",
      "Presque Isle, ['KS'], 1\n",
      "Augusta, ['9K'], 1\n",
      "Bar Harbor, ['9K'], 1\n",
      "Barnstable, ['9K'], 1\n",
      "Lebanon, ['9K'], 1\n",
      "Vineyard Haven MA, ['9K'], 1\n",
      "Provincetown, ['9K'], 1\n",
      "Rockland, ['9K'], 1\n",
      "Rutland, ['9K'], 1\n",
      "Saranac Lake, ['9K'], 1\n",
      "Bellingham, ['G4'], 1\n",
      "Provo, ['G4'], 1\n",
      "Salina, ['K5'], 1\n",
      "Harrison, ['K5'], 1\n",
      "Dillingham, ['KS'], 1\n",
      "St. Petersburg, ['G4'], 1\n",
      "Redding, ['UA'], 1\n",
      "Modesto, ['UA'], 1\n",
      "Klamath Falls, ['UA'], 1\n",
      "Chico, ['UA'], 1\n",
      "Crescent City, ['UA'], 1\n",
      "Arcata CA, ['UA'], 1\n",
      "Hot Springs, ['K5'], 1\n",
      "El Dorado, ['K5'], 1\n",
      "Visalia, ['ZK'], 1\n",
      "Merced, ['ZK'], 1\n",
      "Aspen, ['UA'], 1\n",
      "Santa Rosa, ['AA'], 1\n",
      "Mammoth Lakes, ['AA'], 1\n",
      "PARKERSBURG, ['UA'], 1\n",
      "Jamestown, ['UA'], 1\n",
      "Franklin, ['UA'], 1\n",
      "Du Bois, ['UA'], 1\n",
      "Bradford, ['UA'], 1\n",
      "Punta Gorda, ['G4'], 1\n",
      "Skagway, ['K5'], 1\n",
      "Haines, ['K5'], 1\n",
      "Hoonah, ['K5'], 1\n",
      "Gustavus, ['K5'], 1\n",
      "Ketchikan, ['AA'], 1\n",
      "Youngstown, ['G4'], 1\n",
      "Latrobe, ['NK'], 1\n",
      "Teterboro, ['TJ'], 1\n",
      "New Bedford, ['9K'], 1\n",
      "Pueblo, ['UA'], 1\n",
      "Kodiak, ['7H'], 1\n",
      "Worcester, ['B6'], 1\n",
      "International Falls, ['DL'], 1\n",
      "Brainerd, ['DL'], 1\n",
      "Vernal, ['DL'], 1\n",
      "Twin Falls, ['DL'], 1\n",
      "Pocatello, ['DL'], 1\n",
      "Lewiston, ['DL'], 1\n",
      "Elko, ['DL'], 1\n",
      "Moab, ['DL'], 1\n",
      "Cedar City, ['DL'], 1\n",
      "Butte, ['DL'], 1\n",
      "Massena, ['9K'], 1\n",
      "Hobbs, ['UA'], 1\n",
      "Nuiqsut, ['7H'], 1\n",
      "Atqasuk, ['7H'], 1\n",
      "Wainwright, ['7H'], 1\n",
      "Bethel, ['7H'], 1\n",
      "Chevak, ['7H'], 1\n",
      "Toksook Bay, ['7H'], 1\n",
      "Nightmute, ['7H'], 1\n",
      "Marshall, ['7H'], 1\n",
      "Kwethluk, ['7H'], 1\n",
      "Quinhagak, ['7H'], 1\n",
      "Kwigillingok, ['7H'], 1\n",
      "Kasigluk, ['7H'], 1\n",
      "Kalskag, ['7H'], 1\n",
      "Kongiganak, ['7H'], 1\n",
      "Hooper Bay, ['7H'], 1\n",
      "Eek, ['7H'], 1\n",
      "Chefornak, ['7H'], 1\n",
      "Havre, ['9K'], 1\n",
      "Cordova, ['7H'], 1\n",
      "Tin City, ['8E'], 1\n",
      "Rockford, ['G4'], 1\n",
      "Kenai, ['7H'], 1\n",
      "Imperial, ['K5'], 1\n",
      "Pellston, ['DL'], 1\n",
      "Escanaba, ['DL'], 1\n",
      "Sault Ste Marie, ['DL'], 1\n",
      "Alpena, ['DL'], 1\n",
      "Hibbing, ['DL'], 1\n",
      "Homer, ['7H'], 1\n",
      "Fort Leonardwood, ['9K'], 1\n",
      "Cape Girardeau, ['9K'], 1\n",
      "Kirksville, ['9K'], 1\n",
      "Marion, ['9K'], 1\n",
      "Quincy, ['9K'], 1\n",
      "Valdosta, ['DL'], 1\n",
      "Columbus Mississippi, ['DL'], 1\n",
      "Dothan, ['DL'], 1\n",
      "Brunswick, ['DL'], 1\n",
      "Athens, ['K5'], 1\n",
      "Altoona, ['UA'], 1\n",
      "Johnstown, ['UA'], 1\n",
      "Molokai, ['HA'], 1\n",
      "Weyers Cave, ['UA'], 1\n",
      "Morgantown, ['UA'], 1\n",
      "Lewisburg, ['UA'], 1\n",
      "Beckley, ['UA'], 1\n",
      "Lancaster, ['LW'], 1\n",
      "Pendleton, ['K5'], 1\n",
      "Ogdensburg, ['9K'], 1\n",
      "Eastsound, ['M5'], 1\n",
      "Port Angeles, ['M5'], 1\n",
      "Sheridan, ['ZK'], 1\n",
      "Riverton WY, ['ZK'], 1\n",
      "McCook, ['ZK'], 1\n",
      "North Platte, ['ZK'], 1\n",
      "Cortez, ['ZK'], 1\n",
      "Scottsbluff, ['ZK'], 1\n",
      "Montrose CO, ['UA'], 1\n",
      "Laramie, ['UA'], 1\n",
      "Hayden, ['UA'], 1\n",
      "Gunnison, ['UA'], 1\n",
      "Vail, ['UA'], 1\n",
      "Galena, ['7H'], 1\n",
      "Ruby, ['7H'], 1\n",
      "Nulato, ['7H'], 1\n",
      "Kaltag, ['7H'], 1\n",
      "Huslia, ['7H'], 1\n",
      "St Mary's, ['7H'], 1\n",
      "Valdez, ['7H'], 1\n",
      "King Salmon, ['KS'], 1\n",
      "Cold Bay, ['KS'], 1\n",
      "Mcgrath, ['KS'], 1\n",
      "Sand Point, ['KS'], 1\n",
      "Belleville, ['G4'], 1\n",
      "Stockton, ['G4'], 1\n",
      "PADUCAH, ['UA'], 1\n",
      "Muskegon, ['UA'], 1\n",
      "Topeka, ['UA'], 1\n",
      "Eau Claire, ['UA'], 1\n",
      "Hancock, ['UA'], 1\n",
      "Rhinelander, ['DL'], 1\n",
      "Iron Mountain, ['DL'], 1\n",
      "Bemidji, ['DL'], 1\n",
      "Aberdeen, ['DL'], 1\n",
      "Los Alamos, ['LW'], 1\n",
      "Sidney, ['9K'], 1\n",
      "Wolf Point, ['9K'], 1\n",
      "Glasgow, ['9K'], 1\n",
      "Glendive, ['9K'], 1\n",
      "Portsmouth, ['G4'], 1\n",
      "Anahim Lake, ['8P'], 1\n",
      "Holy Cross, ['7H'], 1\n",
      "Anvik, ['7H'], 1\n",
      "Russian Mission, ['7H'], 1\n",
      "Mountain Village, ['7H'], 1\n",
      "Shageluk, ['7H'], 1\n",
      "Chuathbaluk, ['7H'], 1\n",
      "Scammon Bay, ['7H'], 1\n",
      "Ogden, ['G4'], 1\n",
      "Kotlik, ['7H'], 1\n",
      "Mekoryuk, ['7H'], 1\n",
      "Togiak Village, ['7H'], 1\n",
      "Kipnuk, ['7H'], 1\n",
      "Friday Harbor, ['M5'], 1\n",
      "Emmonak, ['7H'], 1\n",
      "Alakanuk, ['7H'], 1\n",
      "Koyukuk, ['7H'], 1\n",
      "Sleetmute, ['7H'], 1\n"
     ]
    }
   ],
   "source": [
    "read_TopKCities_w_MostAirlines2()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "import psutil"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total RAM: 16.00 GB\n",
      "Available RAM: 3.00 GB\n",
      "Used RAM: 6.24 GB\n",
      "RAM Usage (%): 81.2%\n",
      "CPU Usage (%): [74.3, 74.0, 35.0, 23.0, 15.0, 27.0, 12.0, 7.0]\n"
     ]
    }
   ],
   "source": [
    "# Check RAM usage\n",
    "ram_usage = psutil.virtual_memory()\n",
    "print(f\"Total RAM: {ram_usage.total / (1024 ** 3):.2f} GB\")\n",
    "print(f\"Available RAM: {ram_usage.available / (1024 ** 3):.2f} GB\")\n",
    "print(f\"Used RAM: {ram_usage.used / (1024 ** 3):.2f} GB\")\n",
    "print(f\"RAM Usage (%): {ram_usage.percent}%\")\n",
    "\n",
    "# Check CPU usage\n",
    "cpu_usage = psutil.cpu_percent(interval=1, percpu=True)\n",
    "print(f\"CPU Usage (%): {cpu_usage}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
